Repository: nextgis/barnaul_data_loader
Catalog: opt/loc/*/barnaul_data_loader.po
Languages: ru

source: Import spatial data
ru: Ввод пространственных данных

source: Update spatial data
ru: Обновление пространственных данных

source: Simple loader
ru: Простой загрузчик

source: Barnaul tools
ru: Инструменты для Барнаула

source: Import spatial data to NGW
ru: Ввод пространственных данных в НГВ

source: Update spatial data in NGW
ru: Обновление пространственных данных в НГВ

source: Simple load/update spatial data in NGW
ru: Простой ввод/замена пространственных данных в НГВ

source: Set input feature class
ru: Выберите класс пространственных объектов

source: Set input feature class spatial reference
ru: Выберите систему координат класса пространственных объектов

source: Set input table
ru: Выберите таблицу

source: Set input feature class field to join
ru: Выберите поле класса пространственных объектов для связи

source: Set input table field to join
ru: Выберите поле таблицы для связи

source: Select output geometry type
ru: Укажите тип геометрии

source: Check to filter invalid geometry
ru: Не загружать невалидные геометрии

source: Set output layer name
ru: Введите имя выходного слоя

source: Select append or reload
ru: Выбор дописать или заменить

source: Reload
ru: Заменить

source: Append
ru: Дописать

source: Failed to get feature dataset %s
ru: Ошибка получения класса пространственных объектов %s

source: Error
ru: Ошибка

source: Failed to get spatial reference for %s
ru: Не удалось получить систему координат для %s

source: Failed to get table %s
ru: Не удалось получить таблицу '%s'

source: The field %s renamed to %s
ru: Поле %s переименовано в %s

source: Force geometry field to %s
ru: Преобразование типа геометрии в %s

source: Form join feature dataset
ru: Создание объединенного слоя

source: Begin operation...
ru: Начать операцию...

source: CreateVectorLayer failed
ru: Ошибка создания выходного слоя

source: Failed to get dataset
ru: Ошибка получения класса пространственных объектов

source: Remove non exist field %s
ru: Удаление отсутсвующего поля %s

source: Failed to delete all features
ru: Ошибка удаления всех записей

source: Failed to project feature # %ld
ru: Ошибка перепроецирования геометрии в записи № %ld

source: Form output feature dataset
ru: Создание выходного слоя

source: Reload spatial data
ru: Замена пространственных данных
